app/controllers/client_controller.rb

  def create
    @client = Client.new
    @client.url = params.require(:url)
    if @client.save
---
INSERT INTO "clients" ("url", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["url", "pepapig.com"], ["created_at", "2015-06-29 11:25:04.465501"], ["updated_at", "2015-06-29 11:25:04.465501"]]