app/controllers/message_controller.rb

SELECT "messages".* FROM "messages" WHERE (for_send = 't' and sent='f' and client_id='87')
UPDATE "messages" SET "sent" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["sent", "t"], ["updated_at", "2015-07-01 02:40:42.954916"], ["id", 5]]
---
  def get_messages
    client_id = params.require(:client_id)
    messages = Store.get_unsent_messages_for_client(client_id)
    messages.each  do |message|
      message.sent = true
      message.save!

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "messages" ("for_send", "sent", "client_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["for_send", "t"], ["sent", "f"], ["client_id", 1], ["created_at", "2015-06-30 11:27:34.360119"], ["updated_at", "2015-06-30 11:27:34.360119"]]
INSERT INTO "subjects" ("text", "message_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "teste"], ["message_id", 1], ["created_at", "2015-06-30 11:26:10.677660"], ["updated_at", "2015-06-30 11:26:10.677660"]]
UPDATE "subjects" SET "message_id" = $1, "updated_at" = $2 WHERE "subjects"."id" = $3  [["message_id", 5], ["updated_at", "2015-07-01 03:07:35.246018"], ["id", 1]]
---
  def send_message
    message = Message.new
    subject = Subject.new
    message.for_send = params.require(:for_send)
    subject.text = params.require(:message)
    client_id = params.require(:client_id)
    message.client = Client.find(client_id)
    message.subject = subject
    message.save!